Tekla Open API Reference for Tekla Structures 2025
Arc.GetHashCode Method
 Get HashCode override
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
Return Value
Type: Int32
[Missing <returns> documentation for "M:Tekla.Structures.Geometry3d.Arc.GetHashCode"]
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace